In [1]:
from faker import Faker
from faker.providers import DynamicProvider #python docs Faker modul...
import pandas as pd
import random

#make sure you have the same random values as vrbdy else
Faker.seed()
fake = Faker('de_DE')
fake.seed_instance()
random.seed(42)
# own FakerProvider (dont support multiple languages)
company_departments_provider = DynamicProvider(
    provider_name='company_department',
    elements=['IT', 'Buchhaltung', 'Vertrieb', 'Kunden_service', 'Dozent']
)
fake.add_provider(company_departments_provider)
# values for the DataFrame
names = [fake.name() for x in range(10)]
salary = [random.randint(10_000, 100_000) for x in range(10)]
department = [fake.company_department() for x in range(10)]
# i like to create dict`s for the df
data = {'namen' : names,
       'gehalt' : salary,
       'abteilung': department}
# finally the data on the fly 
df = pd.DataFrame(data)

In [2]:
df

                     namen  gehalt       abteilung
0             Kevin Schulz   93810          Dozent
1    Herr Robin Vollbrecht   24592     Buchhaltung
2          Arnfried Killer   13278          Dozent
3    Dr. Mattias Tintzmann   46048              IT
4   Prof. Valeria Birnbaum   42098              IT
5     Othmar Paffrath MBA.   39256        Vertrieb
6              Susann Bähr   28289          Dozent
7       Dr. Heidi Weinhold   23434     Buchhaltung
8  Wilhelmine Eimer-Ehlert   98696     Buchhaltung
9         Adalbert Schäfer   81482  Kunden_service

In [3]:
# save it to have consistent data (you know there's these people ;)
df.to_csv('Employe_list.csv', index=False)

In [4]:
df

                     namen  gehalt       abteilung
0             Kevin Schulz   93810          Dozent
1    Herr Robin Vollbrecht   24592     Buchhaltung
2          Arnfried Killer   13278          Dozent
3    Dr. Mattias Tintzmann   46048              IT
4   Prof. Valeria Birnbaum   42098              IT
5     Othmar Paffrath MBA.   39256        Vertrieb
6              Susann Bähr   28289          Dozent
7       Dr. Heidi Weinhold   23434     Buchhaltung
8  Wilhelmine Eimer-Ehlert   98696     Buchhaltung
9         Adalbert Schäfer   81482  Kunden_service

In [5]:
# load every thing in our pandas DataFrame
import pandas as pd
df_neu = pd.read_csv('Employe_list.csv')

In [6]:
# show every thing

In [7]:
df_neu

                     namen  gehalt       abteilung
0             Kevin Schulz   93810          Dozent
1    Herr Robin Vollbrecht   24592     Buchhaltung
2          Arnfried Killer   13278          Dozent
3    Dr. Mattias Tintzmann   46048              IT
4   Prof. Valeria Birnbaum   42098              IT
5     Othmar Paffrath MBA.   39256        Vertrieb
6              Susann Bähr   28289          Dozent
7       Dr. Heidi Weinhold   23434     Buchhaltung
8  Wilhelmine Eimer-Ehlert   98696     Buchhaltung
9         Adalbert Schäfer   81482  Kunden_service

# <font color='green'>Now the `Basic's` for work with <u>`DataFrames`</u>

In [8]:
# for example this is a DataFrame of your employee's
# you see with this cmd some aggra_function
df_neu.describe()

             gehalt
count     10.000000
mean   49098.300000
std    30980.795629
min    13278.000000
25%    25516.250000
50%    40677.000000
75%    72623.500000
max    98696.000000

In [9]:
# here you can see if there are NONE values and other things
# we want to jnow how is the avg salary every department(abteilung)
df_neu.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   namen      10 non-null     object
 1   gehalt     10 non-null     int64
 2   abteilung  10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [10]:
# it's common practice
df = df_neu

### we use `groupby` sorted by income and get `AVG` of every department

In [11]:
df.groupby('abteilung')['gehalt'].mean()

abteilung
Buchhaltung       48907.333333
Dozent            45125.666667
IT                44073.000000
Kunden_service    81482.000000
Vertrieb          39256.000000
Name: gehalt, dtype: float64

In [12]:
# saving for later
avg_salary_dep = df.groupby('abteilung')['gehalt'].mean()

In [13]:
df

                     namen  gehalt       abteilung
0             Kevin Schulz   93810          Dozent
1    Herr Robin Vollbrecht   24592     Buchhaltung
2          Arnfried Killer   13278          Dozent
3    Dr. Mattias Tintzmann   46048              IT
4   Prof. Valeria Birnbaum   42098              IT
5     Othmar Paffrath MBA.   39256        Vertrieb
6              Susann Bähr   28289          Dozent
7       Dr. Heidi Weinhold   23434     Buchhaltung
8  Wilhelmine Eimer-Ehlert   98696     Buchhaltung
9         Adalbert Schäfer   81482  Kunden_service

In [14]:
# know we want to know how many employee have each department
df.groupby('abteilung')['namen'].count()

abteilung
Buchhaltung       3
Dozent            3
IT                2
Kunden_service    1
Vertrieb          1
Name: namen, dtype: int64

In [15]:
# in this case we have a look at the department `Dozent`

In [16]:
df[df['abteilung']== 'Dozent']

             namen  gehalt abteilung
0     Kevin Schulz   93810    Dozent
2  Arnfried Killer   13278    Dozent
6      Susann Bähr   28289    Dozent

In [17]:
df[df['abteilung']== 'Dozent'].describe()#work's as well

             gehalt
count      3.000000
mean   45125.666667
std    42824.709740
min    13278.000000
25%    20783.500000
50%    28289.000000
75%    61049.500000
max    93810.000000

In [18]:
# know we get the avg salary and check it

In [19]:
df[df['abteilung']== 'Dozent']['gehalt'].mean()

np.float64(45125.666666666664)

In [20]:
# we see at 2.nd place the `mean` and it's the same

In [21]:
#muötiple aggra functions at once passible
df[df['abteilung'] == 'Dozent']['gehalt'].agg(['sum', 'min', 'max', 'mean', 'std'])

sum     135377.000000
min      13278.000000
max      93810.000000
mean     45125.666667
std      42824.709740
Name: gehalt, dtype: float64

In [22]:
whos

Variable                       Type               Data/Info
-----------------------------------------------------------
DynamicProvider                type               <class 'faker.providers.DynamicProvider'>
Faker                          type               <class 'faker.proxy.Faker'>
avg_salary_dep                 Series             abteilung\nBuchhaltung   <...>e: gehalt, dtype: float64
company_departments_provider   DynamicProvider    <faker.providers.DynamicP<...>ct at 0x000002036EE10920>
data                           dict               n=3
department                     list               n=10
df                             DataFrame                               name<...>r   81482  Kunden_service
df_neu                         DataFrame                               name<...>r   81482  Kunden_service
fake                           Faker              <faker.proxy.Faker object at 0x000002036ECA2AB0>
names                          list               n=10
pd                             module             <module 'pandas' from 'c:<...>es\\pandas\\__init__.py'>
random                         module             <module 'random' from 'c:<...>thon312\\Lib\\random.py'>
salary                         list               n=10

In [23]:
# again safe for later
descr_dep_DZNT = df[df['abteilung']== 'Dozent']['gehalt'].agg(['sum', 'min', 'max', 'mean', 'std'])

In [24]:
print('\033[31;4m1.st insight of the AVG\nof every department\033[32m\n', avg_salary_dep)

1.st insight of the AVG
of every department
 abteilung
Buchhaltung       48907.333333
Dozent            45125.666667
IT                44073.000000
Kunden_service    81482.000000
Vertrieb          39256.000000
Name: gehalt, dtype: float64

In [25]:
print(f'\033[34mLast but not least\nThe discribtion of the "Dozenten"\n{descr_dep_DZNT}')

Last but not least
The discribtion of the "Dozenten"
sum     135377.000000
min      13278.000000
max      93810.000000
mean     45125.666667
std      42824.709740
Name: gehalt, dtype: float64